#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Расставьте знаки операций "плюс", "минус", "умножение" и скобки
# между числами "1 2 3 4 5" так, что бы получилось число "25".
#
# Использовать нужно только указанные знаки операций, но не обязательно все перечесленные.
# Порядок чисел нужно сохранить.

# Пример для чисел "1 2 3" и "9"
result = (1 + 2) * 3
print(result)

# TODO написать формулу для 1 2 3 4 5 и вывести значение на консоль
#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Вариант 1
result = 1 * (2 + 3) * 5
print(result) # 25

# Вариант 2 (если нужно все 4 действия)
# result = (1 * 2 + 3) * 5 # Тоже 25